"""
[Title/Звание]
Battleships Game

[Description/Обрисовка]
Целта на играта е да потопиш всички кораби на опонента си.

Играят двама играчи един срещу друг. Всеки играч притежава набор от кораби, 
които поставя на своята част от дъската. Противниковият играч не вижда 
местоположението на корабите на своя опонент. Чрез изтрели към дадена клетка
от дъската всеки играч се опитва да уцели противниковите кораби, като отгатва тяхното местоположение.
След всеки изтрел играчът получава отговор дали е уцелил част от кораб или е пропуснал.
Играчите се редуват, като всеки прави по един изтрел. Успешен изтрел, уцелена част от кораб, дава
възможност за втори последващ изтрел. Даден кораб бива потопен когато всички негови части са уцелени.
Играчът губи, когато всички негови кораби са потопени.

Тагове: Turn-based game, 2-player game, 2D top-down game, strategy game, single player, multiplayer game, pvp game, board game

[Functionalities/Надарености]

## Основен вариант на играта

Основният вариант на играта е документиран тук: https://en.wikipedia.org/wiki/Battleship_(game)

Правила:
1. Игралното поле на всеки играч представлява мрежа от 10x10 клетки, където играчът разплога корабите си върху своето поле.

2. Всеки играч има на полето си:
    - 1 кораб, състоящ се от 5 клетки;
    - 2 кораба, състоящи се от 4 клетки;
    - 3 кораба, състоящи се от 3 клетки;
    - 4 кораба, състоящи се от 2 клетки;

3. Корабите не могат да се допират един до друг. Трябва да има поне едно поле разстояние
между всеки два кораба (дори и по диагонала). Играчите не могат да местят корабите си, 
след приключване на началната фаза на играта - поставянето на корабите.

4. Всеки играч има право на един опит, в който стреля по една-единствена клетка. 
Единствено след успешен изтрел се получава възможност за стреляне
по друга клетка в същия ход.

5. Печели този, който първи потопи корабите на опонента си.

## Модерен вариант с gimmicks (Идеи)

Играта предоставя варианти, където могат да се очакват нарушения 
по множество от гореописаните правила. 

Например:
- игралното поле може да е с различен размер, да има обекти, 
с които играчите да взаимодействат.
- други видове кораби извън стандартните.
- вариант за изтрели, които покриват повече от една клетка.

## Ботове

Играта може да се играе single player срещу ботове. 
Предлага се възможност на играча да избере противников бот,
използващ различни стратегии. Различната сложност на опонента
предоставя възможност както за начинаещи, така и за напреднали играчи
да имат оспорвана битка. Най-трудният бот използва оптимална стратегия.

## Multiplayer

Играта може да се играе в мрежа с друг играч - Player versus player (PvP).
Това дава възможност за тестване на уменията срещу друг реален играч,
който има собствена уникална стратегия. Играта срещу приятели и познати
също е възможна.

[Milestones/Възлови точки]
- Начален екран - избиране на вид игра single player/ multiplayer.
- Екран за началната фаза - поставянето на корабите (Interface).
- Entity-та - игрално поле, кораби.
- Visuals - визуална репрезентация на обектите.
- Проверки за позицията на корабите.
- Алгоритми за поведението на бота.
- Осъществяване на връзка с реален противник при multiplayer.
- Сървър, който поддържа игрите (всяка игра е стая). / Player-to-player връзка.
- Главна логика на играта - начало, край, ход, изтрел, успешен/ неуспешен изтрел. 
- Проверки за потребителски вход (user input).

[Usage of technologies/Потребление на технологии]
- Pygame
- Вградени модули - random, collections, sys, os.
- Математически модули - алгоритми за ботовете.
- За multiplayer-a socket, threading.

[Estimate in man-hours/Времеоценка в човекочасове]
- Разучаване на Pygame - 4 човекочасове.
- Изготвяне на начална фаза за поставяне на кораби с повечето подробности - 20 чч.
- Имплементиране на visuals - 6 чч.
- Изготвяне на основната логика по играта + ботове - 12 чч.
- Осъществяване на връзката между 2ма играчи - 12 чч.
- Тестове - 12 чч.

Общо - 66 човекочасове.

Човекочасовете са скалируеми и не са задължително репрезентация на 1 час труд.
Също така подлежат на стандартно отклонение от изписаното средно. 

[Out of scope/Допълнителни точки]
- Извън обхвад на проекта, но интересна идея: 
Вариант с движещи се кораби след началната фаза.
- Потребителски профил с Numpy/ Pandas за потенциални статистики.
- Скалиране на трафика при голям брой клиенти при използване на сървър.
- Красив user interface (UI).

[Notes/ Бележки]
- Частта с Modern variant може да бъде изцяло преместена в "Out of scope".
- Фокусът на приложението може да се измести
към Modern Variants and gimmicks в gameplay-a вместо Multiplayer, което да доведе
до изместване на частта с Multiplayer-а/ Server-а в "Out of scope".
- Името на играта подлежи на промяна спрямо идентифициране на фокуса и основния point на играта.
Например ако има динозавър в морето кoйто изяжда случаен кораб, подходящо заглавие би било
Seazavour Battleships Defence и т.н.
"""
